# -*- mode: Org; org-confirm-babel-evaluate: nil; -*-
#+TITLE:       Development plan notes
#+AUTHOR:      Joe Linoff
#+DESCRIPTION:
#+SEQ_TODO:    TODO WIP | DONE CANCELLED
#+OPTIONS:     toc:1
#+LATEX:       \setlength{\parskip}{\baselineskip}%
#+LATEX:       \setlength\parindent{0pt}
#+SETUPFILE:   https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS:     ^:{}

** Mobile Testing
   #+BEGIN_SRC shell :results output
     date
     cp www/examples/example1.txt www/examples/joe.txt $HOME/icloud/myvault
     ls -l $HOME/icloud/myvault/
     sum $HOME/icloud/myvault/*
   #+END_SRC
   #+RESULTS:
   #+begin_example
   Tue May 24 16:00:08 PDT 2022
   total 248
   -rw-r--r--@ 1 jlinoff  575902425   2421 May 24 16:00 example1.txt
   -rw-r--r--@ 1 jlinoff  575902425   2816 May  2 20:57 joe.txt
   -rw-r--r--@ 1 jlinoff  575902425  45272 May 23 16:25 newdata.pam
   -rw-r--r--@ 1 jlinoff  575902425  67403 Apr  9 15:33 vault.txt
   44851 3 /Users/jlinoff/icloud/myvault/example1.txt
   34995 3 /Users/jlinoff/icloud/myvault/joe.txt
   741 45 /Users/jlinoff/icloud/myvault/newdata.pam
   23923 66 /Users/jlinoff/icloud/myvault/vault.txt
   #+end_example

** Backup to cloud
    #+BEGIN_SRC shell :results output
      date
      git log -2
      make backup
      cp backup-pam.tar $HOME/icloud/
      ls -l $HOME/icloud/backup-pam.tar
      echo backup done on $(date)
   #+END_SRC
   #+RESULTS:
   #+begin_example
   Mon May 30 16:54:25 PDT 2022
   commit b91719da173ae8824d94d61afeb575fdb18d7924
   Author: jlinoff <jlinoff@versive.com>
   Date:   Mon May 30 16:54:14 2022 -0700

       update help

   commit 109b0b56262462bd2a40b5c5b470cc2ac81d512b
   Author: jlinoff <jlinoff@versive.com>
   Date:   Mon May 30 16:27:16 2022 -0700

       update plan
   [35;1m
   =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=
   =-=-= Target: backup 
   =-=-= Date: Mon May 30 16:54:25 PDT 2022 
   =-=-= Directory: /Users/jlinoff/work/web/pam 
   =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=[0m
   -rw-r--r--  1 jlinoff  575902425    37M May 30 16:54 backup-pam.tar
   -rw-r--r--  1 jlinoff  575902425  38780944 May 30 16:54 /Users/jlinoff/icloud/backup-pam.tar
   backup done on Mon May 30 16:54:44 PDT 2022
   #+end_example
   #+begin_example
   Sat May 21 08:02:01 PDT 2022 commit
   e57d914a6469001353dd2bacd1f15e33507d59bd Author: jlinoff
   <jlinoff@versive.com> Date: Sat May 21 08:01:51 2022 -0700

       update plan

   commit 2347e6707a864f43b94317305c44418c274e713d Author: jlinoff
   <jlinoff@versive.com> Date: Sat May 21 08:01:17 2022 -0700

       fix record button wrap problem [35;1m
   =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=
   =-=-= Target: backup =-=-= Date: Sat May 21 08:02:01 PDT 2022 =-=-=
   Directory: /Users/jlinoff/work/web/pam
   =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=[0m
   -rw-r--r-- 1 jlinoff 575902425 3.5M May 21 08:02 backup-pam.tar
   -rw-r--r-- 1 jlinoff 575902425 3618084 May 21 08:02
   /Users/jlinoff/icloud/backup-pam.tar backup done on Sat May 21
   08:02:03 PDT 2022 #+end_example

** Backup to USB
   #+BEGIN_SRC shell :results output
      date
      git log -2
      make backup
      cp backup-pam.tar /Volumes/SAMSUNG-USB-256-2/work/backup-pam.tar
      ls -l /Volumes/SAMSUNG-USB-256-2/work/backup-pam.tar
      echo backup done on $(date)
   #+END_SRC
   #+RESULTS:
   #+begin_example
   Sun May 15 09:04:20 PDT 2022 commit
   5b0b2a4162d10e1e97d0fa4e2d360123b050afd6 Author: jlinoff
   <jlinoff@versive.com> Date: Sun May 15 09:04:13 2022 -0700

       update plan

   commit 555752ebf887497c782ab42c347b286d9b1c66e5 Author: jlinoff
   <jlinoff@versive.com> Date: Sat May 14 22:02:02 2022 -0700

       update plan

   commit 2c50a797fbfb74a3441cf5b7d342a6a69d5d8a22 Author: jlinoff
   <jlinoff@versive.com> Date: Sat May 14 21:59:37 2022 -0700

       fix record title input bug [35;1m
   =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=
   =-=-= Target: backup =-=-= Date: Sun May 15 09:04:20 PDT 2022 =-=-=
   Directory: /Users/jlinoff/work/web/pam
   =-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=-=[0m
   -rw-r--r-- 1 jlinoff 575902425 2.4M May 15 09:04 backup-pam.tar
   -rw-r--r-- 1 jlinoff 575902425 2506748 May 15 09:04
   /Volumes/SAMSUNG-USB-256-2/work/backup-pam.tar backup done on Sun
   May 15 09:04:21 PDT 2022 #+end_example

** Update brew
   #+BEGIN_SRC shell :results output
     date
     brew update
     brew upgrade
     brew cleanup
     brew doctor
     echo brew update done on $(date)
   #+END_SRC
   #+RESULTS:
   : Sat Apr 30 08:22:29 PDT 2022
   : Your system is ready to brew.
   : brew update done on Sat Apr 30 08:22:55 PDT 2022

